Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 11, 256)           1536      
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 7, 256)            327936    
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 3, 256)            327936    
_________________________________________________________________
flatten (Flatten)            (None, 768)               0         
_________________________________________________________________
dense (Dense)                (None, 13)                9997      
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 14        
=================================================================
Total params: 667,419
Trainable params: 667,419
Non-trainable params: 0
_________________________________________________________________
MSE: 434.2574
MAE: 13.6754
r2: 0.9953