Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 11, 6)             36        
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 7, 6)              186       
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 3, 6)              186       
_________________________________________________________________
flatten (Flatten)            (None, 18)                0         
_________________________________________________________________
dense (Dense)                (None, 12)                228       
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 13        
=================================================================
Total params: 649
Trainable params: 649
Non-trainable params: 0
_________________________________________________________________
MSE: 995.9689
MAE: 18.3431
r2: 0.9799