Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 11, 256)           1536      
_________________________________________________________________
flatten (Flatten)            (None, 2816)              0         
_________________________________________________________________
dense (Dense)                (None, 20)                56340     
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 21        
=================================================================
Total params: 57,897
Trainable params: 57,897
Non-trainable params: 0
_________________________________________________________________
MSE: 383.5482
MAE: 10.6371
r2: 0.9926